{
  "movies": [
{
      "id": "1",
      "type": "Film",
      "title": "Batman: The Movie",
      "director": "Leslie H. Martinson",
      "year": "1966",
      "rating":"6.5/10",
      "star": "Burt Ward",
      "reviews": "",
      "about": "The arch-villains of the United Underworld - the Joker, the Penguin, the Riddler and the Catwoman - combine forces to dispose of Batman and Robin as they launch their fantastic plot to control the entire world. From his submarine, Penguin and his cohorts hijack a yacht containing a dehydrator, which can extract all moisture from humans and reduce them to particles of dust. The evildoers turn the nine Security Council members in the United World Building into nine vials of multicolored crystals! Batman and Robin track the villains in their Batboat and use Batcharge missiles to force the submarine to surface.",
      "cast": "Adam West, Burt Ward, Lee Meriwether, Cesar Romero, Burgess Meredith, Frank Gorshin",
      "image": "https://m.media-amazon.com/images/M/MV5BMmM1OGIzM2UtNThhZS00ZGNlLWI4NzEtZjlhOTNhNmYxZGQ0XkEyXkFqcGdeQXVyNTkxMzEwMzU@._V1_.jpg"
      },
      {
      "id": "2",
      "type": "Film",
      "title": "Batman",
      "director": "Tim Burton",
      "year": "1989",
      "rating":"7.5/10",
      "star": "Michael Keaton",
      "reviews": "",
      "about": "Gotham City. Crime boss Carl Grissom (Jack Palance) effectively runs the town but there's a new crime fighter in town - Batman (Michael Keaton). Grissom's right-hand man is Jack Napier (Jack Nicholson), a brutal man who is not entirely sane... After falling out between the two Grissom has Napier set up with the Police and Napier falls to his apparent death in a vat of chemicals. However, he soon reappears as The Joker and starts a reign of terror in Gotham City. Meanwhile, reporter Vicki Vale (Kim Basinger) is in the city to do an article on Batman. She soon starts a relationship with Batman's everyday persona, billionaire Bruce Wayne.",
      "cast": "Jack Nicholson, Michael Keaton, Kim Basinger, Robert Wuhl, Pat Hingle, Billy Dee Williams, Michael Gough, Jack Palance",
      "image": "https://m.media-amazon.com/images/M/MV5BZDNjOGNhN2UtNmNhMC00YjU4LWEzMmUtNzRkM2RjN2RiMjc5XkEyXkFqcGdeQXVyMTU0OTM5ODc1._V1_.jpg"
      },
    {
      "id": "3",
      "title": "Batman Returns",
      "director": "Tim Burton",
      "year": "1992",
      "rating": "7.1/10",
      "star": "Michael Keaton",
      "reviews": "",
      "about": "In the sewers of Gotham City to the rooftops of the Gotham City, the Penguin (Danny DeVito) wants to know from where he came. Catwoman (Michelle Pfeiffer) plans to kill rich man of Gotham Max Shreck (Christopher Walken) but as he battles with millionaire Bruce Wayne (Michael Keaton) both ladies' men have their own secrets. Bruce Wayne is back as Batman trying to stop the penguin; Max is helping Penguin steal Gotham City while Selina Kyle/Catwoman tries to help Penguin not knowing her man murder target also her murder is helping him but all four men have their goals taking Gotham from crime-winning Gotham City assassination for two men and more money to be Gotham City's number one rich man.",
      "cast": "Michael Keaton, Danny DeVito, Michelle Pfeiffer, Christopher Walken, Michael Gough, Pat Hingle, Michael Murphy",
      "image": "https://m.media-amazon.com/images/M/MV5BOGZmYzVkMmItM2NiOS00MDI3LWI4ZWQtMTg0YWZkODRkMmViXkEyXkFqcGdeQXVyODY0NzcxNw@@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "4",
      "title": "Batman Forever",
      "director": "Joel Schumacher",
      "year": "1995",
      "rating": "5.4/10",
      "star": "Val Kilmer",
      "reviews": "",
      "about": "The Dark Knight of Gotham City confronts a dastardly duo: Two-Face and the Riddler. Formerly District Attorney Harvey Dent, Two-Face incorrectly believes Batman caused the courtroom accident which left him disfigured on one side; he has unleashed a reign of terror on the good people of Gotham. Edward Nygma, computer-genius and former employee of millionaire Bruce Wayne, is out to get the philanthropist; as The Riddler he perfects a device for draining information from all the brains in Gotham, including Bruce Wayne's knowledge of his other identity. Batman/Wayne is/are the love focus of Dr. Chase Meridan. Former circus acrobat Dick Grayson, his family killed by Two-Face, becomes Wayne's ward and Batman's new partner Robin the Boy Wonder.",
      "cast": "Val Kilmer, Tommy Lee Jones, Jim Carrey, Nicole Kidman, Chris O'Donnell, Michael Gough, Pat Hingle",
      "image": "https://m.media-amazon.com/images/M/MV5BNDdjYmFiYWEtYzBhZS00YTZkLWFlODgtY2I5MDE0NzZmMDljXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "5",
      "title": "Batman and Robin",
      "director": "Joel Schumacher",
      "year": "1997",
      "rating": "3.7/10",
      "star": "George Clooney",
      "reviews": "",
      "about": "Batman and Robin are back working side-by-side to stop the villains of Gotham City, but is there tension appearing between them, especially when one villainess who calls herself Poison Ivy can make anyone fall in love with her...literally. Along with Poison Ivy, the icy Mr. Freeze is freezing anything which gets in his way from achieving his goal.",
      "cast": "Arnold Schwarzenegger, George Clooney, Chris O'Donnell, Uma Thurman, Alicia Silverstone, Michael Gough, Pat Hingle, Elle Macpherson",
      "image": "https://m.media-amazon.com/images/M/MV5BMGQ5YTM1NmMtYmIxYy00N2VmLWJhZTYtN2EwYTY3MWFhOTczXkEyXkFqcGdeQXVyNTA2NTI0MTY@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "6",
      "title": "Batman Begins",
      "director": "Christopher Nolan",
      "year": "2005",
      "rating": "8.2/10",
      "star": "Chistian Bale",
      "reviews": "",
      "about": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia, where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as Batman. But it doesn't stay quiet for long.",
      "cast": "Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, Morgan Freeman",
      "image": "https://m.media-amazon.com/images/M/MV5BOTY4YjI2N2MtYmFlMC00ZjcyLTg3YjEtMDQyM2ZjYzQ5YWFkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "7",
      "title": "The Dark Knight",
      "director": "Christopher Nolan",
      "year": "2008",
      "rating": "9/10",
      "star": "Chistian Bale",
      "reviews": "",
      "about": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as The Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to confront everything he believes and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes.",
      "cast": "Christan Bale, Heath Ledger, Aaron Eckhart, Michael Caine, Maggie Gyllenhaal, Gary Oldman, Morgan Freeman",
      "image": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "8",
      "title": "The Dark Knight Rises",
      "director": "Christopher Nolan",
      "year": "2012",
      "rating": "8.4/10",
      "star": "Chistian Bale",
      "reviews": "",
      "about": "Despite his tarnished reputation after the events of The Dark Knight (2008), in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its Police force, which is struggling to cope with Bane's plans to destroy the city.",
      "cast": "Christian Bale, Michael Caine, Gary Oldman, Anne Hathaway, Tom Hardy, Marion Cotillard, Joseph Gordon-Levitt, Morgan Freeman",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "9",
      "title": "Batman v Superman: Dawn of Justice",
      "director": "Zack Snyder",
      "year": "2016",
      "rating": "6.4/10",
      "star": "Ben Affleck",
      "reviews": "",
      "about": "The general public is concerned over having Superman on their planet and letting the Dark Knight - Batman - pursue the streets of Gotham. While this is happening, a power-phobic Batman tries to attack Superman. Meanwhile, Superman tries to settle on a decision, and Lex Luthor, the criminal mastermind and millionaire, tries to use his own advantages to fight the Man of Steel",
      "cast": "Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Diane Lane, Laurence Fishburne, Jeremy Irons, Holly Hunter, Gal Gadot",
      "image": "https://cdn11.bigcommerce.com/s-ydriczk/images/stencil/1280x1280/products/87632/89085/Batman_V_Superman_Dawn_Of_Justice_Regular_Style_buy_original_movie_posters_at_starstills__12588.1456936452.jpg?c=2"
    },
    {
      "id": "10",
      "title": "The Lego Batman Movie",
      "director": "Chris McKay",
      "year": "2017",
      "rating": "7.3/10",
      "star": "Will Arnett",
      "reviews": "",
      "about": "There are big changes brewing in Gotham City, and if he wants to save the city from The Joker's hostile takeover, Batman may have to drop the lone vigilante thing, try to work with others and maybe, just maybe, learn to lighten up",
      "cast": "Will Arnett, Michael Sera, Rosario Dawson, Ralph Fiennes, Zach Galifianakis, Jenny Slate, Conan O'Brien, Billy Dee Williams, Jason Mantzoukas, Doug Benson",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcyNTEyOTY0M15BMl5BanBnXkFtZTgwOTAyNzU3MDI@._V1_FMjpg_UX1000_.jpg"
    },
    {
      "id": "11",
      "title": "The Batman",
      "director": "Matt Reeves",
      "year": "2022",
      "rating": "7.8/10",
      "star": "Robert Pattinson",
      "reviews": "",
      "about": "Two years of nights have turned Bruce Wayne into a nocturnal animal. But as he continues to find his way as Gotham's dark knight Bruce is forced into a game of cat and mouse with his biggest threat so far, a manic killer known as The Riddler who is filled with rage and determined to expose the corrupt system whilst picking off all of Gotham's key political figures. Working with both established and new allies, Bruce must track down the killer and see him brought to justice, while investigating his father's true legacy and questioning the affect that he has had on Gotham so far as The Batman.",
      "cast": "Robert Pattinson, Zoë Kravitz, Colin Farrell, Andy Serkis, Paul Dano, Jeffrey Wright, John Turturro, Peter Sarsgaard, Jayme Lawson, Barry Keoghan",
      "image": "https://m.media-amazon.com/images/M/MV5BYTExZTdhY2ItNGQ1YS00NjJlLWIxMjYtZTI1MzNlMzY0OTk4XkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg"
    }
  ]
}